package com.green.day5.ch2;

public class ConstLiteral {
    public static void main(String[] args){
       //리터럴=값 그 자체. 현실에서 이야기하는 상수와 같음
            //프로그래밍 쪽에서만 사용하는 언어
        //상수=한번 입력된 값이 수정이 안 되는 공간
            //ex. final int MAX_SPEED(상수)=240(리터럴);
            //상수의 변경을 시도할 시 컴파일 에러 발생
            //상수의 필요 이유: 중간에 값이 변하면 큰일나는 것 ex.파이
            //변수는 변할 수 있다는 기능이 있어서 상수보다 느림. 변할 필요 없는 것에 쓰면 좋음

        //???21 프로모티브 타입

        //에러의 종류
            //1. 작성했더니 빨간줄 =컴파일 에러(컴파일 자체가 안 됨)
                //타입드 언어??가 컴파일 에러를 발생(실행 전에 알 수 있음)
            //2. 실행을 했더니 에러=런 타임 에러

    }
}
